{"id":851,"name":"Centiskorch","genus":"Radiator Pokémon","description":"Gigantamax energy has evoked a rise in its body temperature, now reaching over 1,800 degrees Fahrenheit. Its heat waves incinerate its enemies.","imageUrl":"https://raw.githubusercontent.com/anurag-roy/poke-api/main/assets/images/851.webp","types":["Fire","Bug"],"abilities":[{"name":"Flash Fire","effect":"This Pokémon is immune to fire-type moves.  Once this Pokémon has been hit by a Fire move, its own Fire moves will inflict 1.5× as much damage until it leaves battle.  This ability has no effect while the Pokémon is frozen.  The Fire damage bonus is retained even if the Pokémon is frozen and thawed or the ability is lost or disabled.  Fire moves will ignore this Pokémon's substitute.  This ability takes effect even on non-damaging moves, i.e. will o wisp.","description":"Powers up if hit by fire."},{"name":"White Smoke","effect":"This Pokémon cannot have its stats lowered by other Pokémon.  This ability does not prevent any stat losses other than stat modifiers, such as the Speed cut from paralysis; nor self-inflicted stat drops, such as the Special Attack drop from overheat; nor opponent-triggered stat boosts, such as the Attack boost from swagger.  This Pokémon can still be passed negative stat modifiers through guard swap, heart swap, or power swap.  This ability functions identically to clear body in battle.  Overworld: If the lead Pokémon has this ability, the wild encounter rate is halved.","description":"Prevents ability reduction."},{"name":"Flame Body","effect":"Whenever a move makes contact with this Pokémon, the move's user has a 30% chance of being burned.  Overworld: If any Pokémon in the party has this ability, each egg in the party has its hatch counter decreased by 2 (rather than 1) each step cycle, making eggs hatch roughly twice as quickly.  This effect does not stack if multiple Pokémon have this ability or magma armor.","description":"Burns the foe on contact."}],"stats":{"HP":100,"Attack":115,"Defense":65,"Special Attack":90,"Special Defense":90,"Speed":65},"locations":[],"color":"#b6aaab"}